tbobd/certification3/test1/HotelBookRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
</hot:Credentials>
<wsa:Action>http://TekTravel/HotelBookingApi/HotelBook</wsa:Action>
<wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelBookRequest>
        <hot:AgencyReferenceNumber>BUGSOFT1</hot:AgencyReferenceNumber>
        <hot:ClientReferenceNumber>210314135855789#aabd</hot:ClientReferenceNumber>
        <hot:GuestNationality>ES</hot:GuestNationality>
            <hot:Guests>
                <hot:Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Ajayxe</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>30</hot:Age>
            </hot:Guest>
        </hot:Guests>
        <hot:AddressInfo>
            <hot:AddressLine1>testadd1</hot:AddressLine1>
            <hot:AddressLine2>testadd2</hot:AddressLine2>
            <hot:CountryCode>91</hot:CountryCode>
            <hot:AreaCode>11</hot:AreaCode>
            <hot:PhoneNo>25869696</hot:PhoneNo>
            <hot:Email>abc@gmail.com</hot:Email>
            <hot:City>Delhi</hot:City>
            <hot:State>Delhi</hot:State>
            <hot:Country>India</hot:Country>
            <hot:ZipCode>256525</hot:ZipCode>
        </hot:AddressInfo>
        <!-- VoucherBooking-true Booking will be Vouchered -->
        <hot:PaymentInfo VoucherBooking="false" PaymentModeType="Limit">
        </hot:PaymentInfo>
        <hot:SessionId>8324c198-05ae-4bb4-98ae-ff986afe3868</hot:SessionId>
        <hot:NoOfRooms>1</hot:NoOfRooms>
        <hot:ResultIndex>1</hot:ResultIndex>
        <hot:HotelCode>1388817</hot:HotelCode>
        <hot:HotelName>Dulf Hotel Dubai</hot:HotelName>
        <hot:HotelRooms>
            <hot:HotelRoom>
                <hot:RoomIndex>2</hot:RoomIndex>
                <hot:RoomTypeName>Standard Twin Room, 2 Twin Beds</hot:RoomTypeName>
                <hot:RoomTypeCode>219957072|286336326$37341^^1^^219957072|286336326|37341</hot:RoomTypeCode>
                <hot:RatePlanCode>219957072|286336326|37341</hot:RatePlanCode>
                <hot:RoomRate RoomFare="187.81" Currency="USD" AgentMarkUp="0.00" RoomTax="42.18" TotalFare="229.99"/>
                <hot:Supplements>
                    <hot:SuppInfo Type="PerStaySupplement" SuppID="1" SuppName="mandatory_tax" SuppIsMandatory="true" SuppChargeType="AtProperty" Price="40.00" CurrencyCode="AED" />
                </hot:Supplements>
            </hot:HotelRoom>
        </hot:HotelRooms>
    </hot:HotelBookRequest>
</soap:Body>
</soap:Envelope>